openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "opamp.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include <time.h>
#include <math.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>
#include "jsmn.h"
#include "reset.h"
//#include "json.h"
#include "RFM69.h"
#include "RFM69_ext.h"
//#include "ds18b20.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
// test variables
bool testing = true; // generic testing variable for if() statements.
bool dontGiveAMonkeys = false; // don't wait for a VT adaptor to calculate Irms, AP, RP etc.
bool ledBlink = false; // enable or disable LED blinking.
// test variables

char hwVersion[] = "Sombrero_v0.8";
char fwVersion[] = "v0";

//-------------
// MODES
//-------------
// 0 = Standalone
// 1 = rPi
// 2 = ESP32
// 3 = testing
int mode = 1; // initialised as rPi mode for testing.


//------------------------------------------------
// timing, ADCs, power and frequency variables
//------------------------------------------------
#define MID_ADC_READING 2048
uint32_t posting_interval = 2500; // millis to post data at.
bool readings_ready = false;
bool readings_requested = false;
bool first_readings = false;
double V_RATIO;
double I_RATIO;
//const double adc_conversion_time = (614.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
const double adc_conversion_time = (194.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
//const double adc_conversion_time = (74.0*(1.0/(72000000.0/4))); // seems to be the fastest we can sample.
//const double adc_conversion_time = (32.0*(1.0/(72000000.0/4))); // this speed causes buffer overruns.
double mains_frequency;
static double Ws_accumulator[CTn] = {0};


//----------------------------
// CT Settings : Common
//----------------------------


//----------------------------
// CT Settings : Per Channel
//----------------------------


//----------------------------
// VT Settings : Common
//----------------------------


//------------------------
// Channel Accumulators
//------------------------
typedef struct channel_
{
  int64_t sum_P;
  uint64_t sum_V_sq;
  uint64_t sum_I_sq;
  int64_t sum_V;
  int64_t sum_I;
  bool Iclipped; 
  uint32_t count;
  uint32_t cycles;
  bool positive_V;
  bool last_positive_V;
} channel_t; // data struct per CT channel, stm32 only does 32-bit struct items, anything else gets padded out to 32-bit automatically by

static channel_t channels[CTn] = {0};
static channel_t channels_ready[CTn] = {0};
bool channel_rdy_bools[CTn] = {0};


//----------------
// CALIBRATION
//----------------
const double VOLTS_PER_DIV = (3.3 / 4096.0);

const double VCAL = 268.97*0.9940357853*0.9947958367; // default ideal power UK, adjusted
//const double VCAL = 271.748953974895; // measured by DB, 20.5.2020

//const double ICAL = (100/0.05)/22.0; // f(rated input, rated output, burden value)
const double ICAL = (100/0.05)/(26.8); // dan's stm32 consistency check board at 0.2% accuracy burden (53R6 x 2 in parallel).
//const double ICAL = (100/0.05)/50.6; // dan's custom test board.
//const double ICAL = (100/0.05)/456.3; // dan's custom test board.
//const double ICAL = (100/0.05)/1.0; // dan's custom test board.
//const double ICAL = (100/0.05)/(22.0/1000.0);
//const double ICAL = (100.0/0.05)*22.0; // V=I*R. Convert to raw mV signal for testing.

//--------------------
// PHASE CALIBRATION
//--------------------
// Finite Impulse Response (FIR) filter-like Power Factor correction.
// This phase correction can be applied to individual CTs.
// This phase-correction works by selecting the relevant sample from the ADC DMA buffer.
// For example ADC1 has buffer 1, ADC2 has buffer 2. The VT is on buffer 1, the CT is on buffer 2.
// We can choose to pair the relevant sample from buffers one and two, to adjust for time differences (phase shift).
// Each sample is separated at a single conversion time, 10.7usecs, for example, or tripple that for 3-phase.
int hunt_PF[CTn] = {0}; // this is a per-channel state trigger. The array number is the CT channel.
// when above array value {0} equals:
// 0 = no power factor hunting, default at program start.
// 1 = power factor hunt start. This can be triggered from a serial command.
// 2 = power factor hunt to the right. (increase VT lead, automatic).
// 3 = power factor hunt to the left. (increase VT lag, automatic).
// 4 = hunt finishing, finding mode average (automatic).
// 5 = hunt complete.

// This store the actual value of buffer indexes to shift by, for each channel.
static int16_t phase_corrections[CTn] = {0};   // store of phase corrections per channel.

// Below are misc variables to make PF hunting work.
uint8_t phHunt_direction_changes = 0; // we're aiming for phase_correction_iteration_target.
static const int phHunt_direction_change_target = 5; // how many times will the phase hunt change direction?
double last_powerFactor[CTn]; // PF from previous readings.
double powerFactor_now[CTn];  // PF from most recent readings.

//------------------------------------------
// FIR-type filter for phase correction.
//------------------------------------------
uint16_t highest_phase_correction = 0;
void set_highest_phase_correction(void) { // could be done after each correction routine instead.
  highest_phase_correction = 0; // reset. 
  for (int i = 0; i < CTn; i++) {
    if (phase_corrections[i] > highest_phase_correction) highest_phase_correction = phase_corrections[i];
  }
}

bool check_dma_index_for_phase_correction(uint16_t offset) {
  // HAL_DELAY(1); // test
  uint16_t dma_counter_now = hdma_adc1.Instance->CNDTR;
  //sprintf(log_buffer, "dma_counter_now:%d, offset:%d, highest_correction:%d\r\n", dma_counter_now, offset, highest_phase_correction);
  //debug_printf(log_buffer); log_buffer[0] = 0;
  if (offset == 0) {
    if (adc_buff_half_size - dma_counter_now > highest_phase_correction) { return true; }
    else { return false; }
  }
  else if (offset == adc_buff_half_size) {
    if (adc_buff_size - dma_counter_now > highest_phase_correction) {return true; }
    else { return false; }
  }
  return false; // get rid of compiler warning.
}
bool modeFail;
int findmode(int a[],int n) { // https://www.tutorialspoint.com/learn_c_by_examples/mode_program_in_c.htm
   modeFail = false;
   int maxValue = 0, maxCount = 0, i, j;
   for (i = 0; i < n; ++i) {
      int count = 0;
      for (j = 0; j < n; ++j) {
         if (a[j] == a[i])
         ++count;
      }
      if (count > maxCount) {
         maxCount = count;
         maxValue = a[i];
      }
   }
   if (maxCount < 3) debug_printf("No confident value found.\r\n"); modeFail = true;
   return maxValue;
}

int pf_mode_array[5]; // stores the phase_corrections value at the point of switching direction.
int *pf_ptr = pf_mode_array;
int phase_corrections_store_previous_value;
void pfHunt(int ch) {
  if (hunt_PF[ch] == 0 || hunt_PF[ch] == 5) { 
    __NOP();
  }
  else if (hunt_PF[ch] == 1) { // start hunting one direction
    phase_corrections_store_previous_value = phase_corrections[ch];
    phase_corrections[ch]++; hunt_PF[ch]++;
    // print phase correction.
    sprintf(log_buffer, "PFstart++ | CT Channel Number = [number+1].\r\nSetting phase_corrections[%d] to %d\r\n", ch, phase_corrections[ch]);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
  }
  else if (hunt_PF[ch] == 2) { // continue this direction unless...
    sprintf(log_buffer, "PF_now:%.6lf | last_PF:%.6lf | phase_corrections[%d] was at %d, equal to %.2lf degrees phase shift.\r\n", powerFactor_now[ch], last_powerFactor[ch], ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency)))); debug_printf(log_buffer); log_buffer[0] = '\0';
    if (powerFactor_now[ch] > last_powerFactor[ch]) phase_corrections[ch]++; // keep going forwards into the buffer
    else { hunt_PF[ch]++; phHunt_direction_changes++; phase_corrections[ch]--; *pf_ptr = phase_corrections[ch]; pf_ptr++; } // switch direction and start going backwards into the buffer
    // print phase correction.
    sprintf(log_buffer, "PF++ | Setting phase_corrections[%d] to %d. Switched direction %d times.\r\n", ch, phase_corrections[ch], phHunt_direction_changes);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
    if (phHunt_direction_changes == phHunt_direction_change_target) hunt_PF[ch] = 4;
  }
  else if (hunt_PF[ch] == 3) { // hunt the other direction until...
    sprintf(log_buffer, "PF_now:%.6lf | last_PF:%.6lf | phase_corrections[%d] was at %d, equal to %.2lf degrees phase shift.\r\n", powerFactor_now[ch], last_powerFactor[ch], ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency)))); debug_printf(log_buffer); log_buffer[0] = '\0';    
    if (powerFactor_now[ch] > last_powerFactor[ch]) phase_corrections[ch]--; // keep going backwards into the buffer
    else { hunt_PF[ch]--; phHunt_direction_changes++; phase_corrections[ch]++; *pf_ptr = phase_corrections[ch]; pf_ptr++; } // switch direction and go forwards again into the buffer
    // print phase correction.
    sprintf(log_buffer, "PF-- | Setting phase_corrections[%d] to %d. Switched direction %d times.\r\n", ch, phase_corrections[ch], phHunt_direction_changes);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
    if (phHunt_direction_changes == phHunt_direction_change_target) hunt_PF[ch] = 4;
  }
  else if (hunt_PF[ch] == 4) {
    // finish up...
    for (int i = 0; i < phHunt_direction_change_target; i++) { sprintf(log_buffer, "pf_mode_array[%d] value was %d\r\n", i, pf_mode_array[i]); debug_printf(log_buffer); }
    
    sprintf(log_buffer, "mode:%d\r\n", findmode(pf_mode_array, phHunt_direction_change_target)); debug_printf(log_buffer); log_buffer[0] = '\0';
    
    phase_corrections[ch] = findmode(pf_mode_array, phHunt_direction_change_target); // the result is set in phase_corrections[] for this channel now.
    if (modeFail) {
      sprintf(log_buffer, "huntPF fail setting phase_corrections[%d] to previous value of %d.\r\n", phase_corrections[ch], phase_corrections_store_previous_value); 
      phase_corrections[ch] = phase_corrections_store_previous_value;
    }
    else {
      sprintf(log_buffer, "Maximum PF found! phase_correction[%d] is at %d, equal to %.2lf degrees phase shift.\r\n", ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency))));
      set_highest_phase_correction(); // update the highest value for 'value ready' buffer checking.
    }
    hunt_PF[ch] = 5;
  }
}


//------------------------
// UART SERIAL BUFFERS
//------------------------
extern char log_buffer[];
char rx_string[COMMAND_BUFFER_SIZE];
char string_buffer[200];
char readings_rdy_buffer[1000];


//----------------
// RADIO
//----------------
bool radioSend = false; // set to 1 to send test data with RFM69.
bool radioReceive = false;
static uint16_t networkID = 210; // a.k.a. Network Group
static uint8_t nodeID = 10; // this node's ID (address).
static uint16_t freqBand = 433; // MHz
static uint8_t toAddress = 1; // destination address.
bool requestACK = false; // untested.
static char encryptkey[20] = {'\0'}; // twenty character encrypt key, or  '\0'  for nothing.
//char encryptkey[20] = "asdfasdfasdfasdf"; // twenty character encrypt key, or  '\0'  for nothing.
typedef struct {
  uint32_t nodeId; 
  uint32_t uptime;
  //double temperature;   // other data
} Payload;
Payload radioData;


//--------------------
// Time variables
//--------------------
uint32_t current_millis;
uint32_t previous_millis;


//----------------
// MISC
//----------------
static uint32_t pulseCount = 0;
extern char json_response[40];
extern int boot_number;

/* USER CODE END PV */

