openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c
      //----------------------------------------
      // Upwards-zero-crossing detection, whole AC cycles.
      channel->last_positive_V = channel->positive_V; // retrieve the previous value.
      if (signed_V >= 0) { channel->positive_V = true; } // changed > to >= . not important as MID_ADC_READING 2048 not accurate anyway.
      else { channel->positive_V = false; }
      //--------------------------------------------------
      //--------------------------------------------------
      if (dontGiveAMonkeys || (!channel->last_positive_V && channel->positive_V)) { // looking out for a upwards-zero crossing.
        channel->cycles++; // rather than count cycles for readings_ready, better to have the main loop ask for them.
        // debug cycle count 
        /*
        sprintf(log_buffer, "cycles%d:%ld\r\n", ch, channel->cycles);
        debug_printf(log_buffer); log_buffer[0] = '\0';
        */
        //----------------------------------------
        if (readings_requested && !channel_rdy_bools[ch]) { // if readings are needed by the main loop and channel is not copied/ready.
          channel_t *channel_ready = &channels_ready[ch];
          // copy accumulators for use in main loop.
          memcpy((void*)channel_ready, (void*)channel, sizeof(channel_t));
          // reset accumulators to zero.
          memset((void*)channel, 0, sizeof(channel_t));
          // follow through the state of positive_v so no extra AC cycle is erroneously counted.
          channel->positive_V = true;
          // set 'channel ready' for this channel.
          channel_rdy_bools[ch] = true;
          // are all the channels ready?
          int chn_ready_count = 0;
          for (int j = 0; j < CTn; j++) {
            if (channel_rdy_bools[j]) chn_ready_count++;
          }
          if (chn_ready_count == CTn) { readings_ready = true; readings_requested = false; }
          
          // test waveform sync. printed result should go from 1 to 9.
          /*
          sprintf(log_buffer, "channelsRdy:%d\r\n", chn_ready_count);
          debug_printf(log_buffer); log_buffer[0] = '\0';
          */
        }
      }
      //-------------------------------------------------- 
      //-------------------------------------------------- end zero-crossing.
    } // end per channel routine
  } // end buffer routine
  if(ledBlink) { HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_RESET);}
  
} // end process_frame().




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  V_RATIO = VCAL * VOLTS_PER_DIV;
  I_RATIO = ICAL * VOLTS_PER_DIV;
  
  //FlashStruct *flashpt = &flash_struct;
  //union Un flashUn; 

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_TIM8_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  MX_TIM16_Init();
  MX_ADC2_Init();
  MX_SPI1_Init();
  MX_SPI4_Init();
  MX_UART4_Init();
  MX_USART3_UART_Init();
  MX_I2C3_Init();
  MX_UART5_Init();
  MX_RTC_Init();
  MX_ADC3_Init();
  MX_OPAMP4_Init();
  /* USER CODE BEGIN 2 */

  debug_printf("\r\n\r\nStart, connect VT.\r\n");

  //------------------------
  // UART DMA RX ENABLE
  //------------------------
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart1, rx_buff, sizeof(rx_buff));
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart2, rx_buff, sizeof(rx_buff));
  //------------------------------
  // UART Non-blocking TX ENABLE
  //------------------------------
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_TC); // necessary only to know if we're good to fire another Tx soon after a HAL_UART_Transmit_IT()
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_TC);  
          // usart1_rx_flag = 1; // debugging


  //-------------------------------------------------
  // Analog Input RNG for Radio Start Delay
  //-------------------------------------------------
  if (radioSend) {  
    int RadDelayCount = 0;
    int RadioDelay;
    while(RadDelayCount < 3) {
      static int reading;
      static int previousRadDelay;
      previousRadDelay = reading;
      
      // ADC read start
      HAL_ADC_Start(&hadc3);
      while (HAL_ADC_PollForConversion(&hadc3, 1000) != HAL_OK) {__NOP();}
      reading = HAL_ADC_GetValue(&hadc3);
      HAL_ADC_Stop(&hadc3);
      // ADC read end.
      
      RadioDelay = abs((reading - previousRadDelay + 400) * 10); // scale the 'noise'.
      HAL_Delay(100);
      RadDelayCount++;
    }
    sprintf(log_buffer, "RadioDelay:%d\r\n", RadioDelay);
    debug_printf(log_buffer); 
    HAL_Delay (RadioDelay);

    log_buffer[0] = '\0'; // clear buffer.
  } // end RadioDelay.


  //------------------------
  // RTC Backup Registers
  //------------------------
  // RTC backup register test, 16 x 32-bit addresses available.
  // see stm32f3xx_hal_rtc_ex.c  line 1118 onwards.
  //uint32_t bkp_write = 123456789;
  uint32_t bkp_ = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0);
  sprintf(log_buffer, "Number of boots:%ld\r\n", bkp_);
  debug_printf(log_buffer); log_buffer[0] = 0;
  boot_number = bkp_;
  HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, bkp_+1);
  // works!
  
  // RESET CAUSE
  reset_cause_store = reset_cause_get();
  sprintf(log_buffer, "Reset Cause:%s\r\n", reset_cause_get_name(reset_cause_store));
  debug_printf(log_buffer); log_buffer[0] = 0;
  
  
  //------------------------
  // EEPROM Emulation test
  //------------------------
  /*
  char write_data_pgm[50];
  strcpy(write_data_pgm, "Hellow from Flash Memory!\r\n");
  save_to_flash((uint8_t*) write_data_pgm);
  char read_data_pgm[50];
  read_flash((uint8_t*)read_data_pgm);
  debug_printf(read_data_pgm); // print result
  
