openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c
  float write_float_pgm = 123.321f;
  float *pointer_write_float = &write_float_pgm;
  save_to_flash((uint8_t*)pointer_write_float);
  float read_float_pgm = 0.0;
  float *pointer_read_float = &read_float_pgm;
  read_flash((uint8_t*)pointer_read_float);
  //char log_buffer[20];
  sprintf(log_buffer, "Float value also read from flash memory! %.3f\r\n", read_float_pgm);
  debug_printf(log_buffer); log_buffer[0] = 0; // print result
  */

  // int test_array_mode[5] = {2,1,3,4,5};
  // sprintf(log_buffer, "test mode-finding: %d\r\n", findmode(test_array_mode, 5));
  // debug_printf(log_buffer); log_buffer[0] = 0; // print result
  // seems findmode() will return the first value of the array if no mode value is found.


  //------------------------
  // is the rPi Connected?
  //------------------------
  if (HAL_GPIO_ReadPin(rPi_PWR_GPIO_Port, rPi_PWR_Pin) == 1)
  {
    debug_printf("rPi connected!\r\n");
    mode = 1;
  }
  else {
    debug_printf("rPi not connected.\r\n");
    // mode = 0;
  }


  //------------------------
  // RADIO Init
  //------------------------
  RFM69_RST();
  HAL_Delay(20);
  if (RFM69_initialize(freqBand, nodeID, networkID))
  {
    sprintf(log_buffer, "RFM69 Initialized. Freq %dMHz. Node %d. Group %d.\r\n", freqBand, nodeID, networkID);
    debug_printf(log_buffer);
    log_buffer[0] = '\0';
    //RFM69_readAllRegs(); // debug output
  }
  else debug_printf("RFM69 not connected.\r\n");
  
  // if we have a encryption key, radio encryption will be set.
  if (encryptkey[0]) RFM69_encrypt(encryptkey);

  if (radioReceive || radioSend) {
    __NOP();
  }
  else {
    HAL_SPI_MspDeInit(&hspi4); // disable SPI4, for testing.
    debug_printf("SPI4 DeInit'd.\r\n");
  }
  //else {
  //RFM69_interruptHandler();
  //RFM69_receiveDone();
  //}


  //------------------------
  // ADC & OPAMP Start
  //------------------------
  HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc2, ADC_SINGLE_ENDED);
  HAL_Delay(2);
  HAL_OPAMP_Start(&hopamp4);
  HAL_Delay(2);
  start_ADCs();

  //init_ds18b20s(); // temperature sensor

  debug_printf("\r\n");
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    current_millis = HAL_GetTick();

    // process_ds18b20s();
    
    //---------------------------------------
    // Interval for posting power readings.
    //---------------------------------------
    if (current_millis - previous_millis >= posting_interval) {
     
      uint32_t correction = current_millis - previous_millis - posting_interval;
      previous_millis = current_millis - correction;

      //RTC_CalendarShow(aShowTime, aShowDate);
      //debug_printf((char*)aShowDate); debug_printf("\r\n");
      //debug_printf((char*)aShowTime); debug_printf("\r\n");

      if (readings_requested) debug_printf("No voltage waveform present.\r\n");
      //if (testing) goto debugIrms;
      // implement default Vrms value setting and automatic calc of Irms and approximated Power value.
      readings_requested = true;
    }
    

    //------------------------------------------------
    // ADC DMA buffer flags. Process Frames.
    //------------------------------------------------
    if (conv_hfcplt_flag)
    {
      conv_hfcplt_flag = false;
      process_frame(0); // process 1st half of buffer.
    }
    if (conv_cplt_flag)
    {
      conv_cplt_flag = false;
      process_frame(adc_buff_half_size); // process 2nd half of buffer.
    }
    // HAL_Delay(200); // ADC buffer overrun flag test.


    //------------------------------------------------
    // Check to post primary data.
    //------------------------------------------------
    if (readings_ready)
    {
      readings_ready = false; memset(channel_rdy_bools, 0, sizeof(channel_rdy_bools)); // clear flags.
      if (!first_readings) { first_readings = true; goto EndJump; } // discard the first set as beginning of 1st waveform not tracked.
      
      if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_9, GPIO_PIN_SET); } // blink the led
      
      sprintf(readings_rdy_buffer, "STM:1.0,"); // initital write to buffer.
      readings_rdy_buffer[0] = '\0'; // initital write to buffer.

      for (int ch = 0; ch < CTn; ch++)
      {
        channel_t *chn = &channels_ready[ch];

        last_powerFactor[ch] = powerFactor_now[ch];
        calcPower(ch);
        powerFactor_now[ch] = powerFactor;
        pfHunt(ch);

        if (ch == 0) { // estimate mains_frequency on a single channel, no need for more.
          mains_frequency = 1.0/(((chn->count * CTn) / chn->cycles) * adc_conversion_time);
        }

        int _ch = ch + 1; // nicer looking channel numbers. 1 starts at 1 instead of 0.
        if (ch == 8) { // single channel debug output.
          sprintf(string_buffer, "V%d:%.2lf,I%d:%.3lf,AP%d:%.1lf,RP%d:%.1lf,PF%d:%.6lf,Joules%d:%.3lf,Clip%d:%d,cycles%d:%ld,samples%d:%ld,\r\n", _ch, Vrms, _ch, Irms, _ch, apparentPower, _ch, realPower, _ch, powerFactor, _ch, Ws_accumulator[ch], _ch, chn->Iclipped, _ch, chn->cycles, _ch, chn->count);
          strcat(readings_rdy_buffer, string_buffer);
        } // single channel debug output.
      }
/*
      // Main frequency estimate.
      sprintf(string_buffer, "Hz_estimate:%.1f,", mains_frequency);
      if (mode == 1) strcat(readings_rdy_buffer, string_buffer);
      // Millis
      sprintf(string_buffer, "millis:%ld,", current_millis);
      if (mode == 1) strcat(readings_rdy_buffer, string_buffer);
      // Pulsecount
      sprintf(string_buffer, "PC:%ld,", pulseCount);
      if (mode == 1) strcat(readings_rdy_buffer, string_buffer);
      */
      
      /*
      // get an average of the OPAMP4 ADC4 buffer.
      uint32_t ADC4_buff_accumulator = 0;
      for (int i = 0; i < sizeof(adc4_dma_buff); i++) {
        ADC4_buff_accumulator += adc4_dma_buff[i];
        //sprintf(log_buffer, "%d\r\n", adc4_dma_buff[i]);
        //debug_printf(log_buffer);
      }
      //log_buffer[0] = '\0';
      double ADC4_buff_avg = ADC4_buff_accumulator / sizeof(adc4_dma_buff);
      sprintf(string_buffer, "ADC4_avg:%.2f,", ADC4_buff_avg);
      if (mode == 1) strcat(readings_rdy_buffer, string_buffer);
      */
/*
      // has the adc buffer overrun?
      sprintf(string_buffer, "buffOverrun:%d", overrun_adc_buffer);
      overrun_adc_buffer = 0; // reset
      if (mode == 1) strcat(readings_rdy_buffer, string_buffer);

*/
      // close the string and add some whitespace for clarity.
      //if (mode == 1) strcat(readings_rdy_buffer, "\r\n\r\n");


      // RFM69 send.
      if (radioSend) // sending data, test data only.
      {
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }

      if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_9, GPIO_PIN_RESET);}
    } EndJump: // end main readings_ready function.



    //-------------------------------
    // RFM69 Rx
    //-------------------------------
    // This needs checking, does a flag need generating from a DIO0 read = true?
    // Would a flat reduce the SPI business.?
    if(radioReceive) {
      if (RFM69_ReadDIO0Pin()) {
        debug_printf("RFM69 DIO0 high.\r\n");
        //RFM69_interruptHandler();
        if (RFM69_receiveDone()) { // this maybe shouldn't be nested in the previous if(). If Rx doesn't work, could be the problem.
          HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
          HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
          // debug output below.
          debug_printf("RFM69 payload received.\r\n");
          PrintRawBytes();
          //PrintStruct();
          //PrintByteByByte();
          //RFM69_interruptHandler();
          sprintf(log_buffer, "RSSI:%d\r\n", rssi);
          debug_printf(log_buffer);

          RFM69_receiveBegin();
          //RFM69_receiveDone(); // seems to be required.
          log_buffer[0] = '\0';
        }
      }
    } // end radioReceive


    
    /*  // below for testing radio Noise
    if (radioSend) // sending data, test data only.
      {
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
        HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }
    */



    //------------------------
    // UART Rx check
    //------------------------
    if (usart1_rx_flag)
    {
      usart1_rx_flag = 0;
      memcpy(rx_string, rx_buff, sizeof(rx_buff));
      memset(rx_buff, 0, sizeof(rx_buff));
      huart1.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
      huart1.hdmarx->Instance->CNDTR = sizeof(rx_buff);
      huart1.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
      //json_parser("{G:RTC}"); // calling this loads json_response[] with a response.
      json_parser(rx_string); // calling this loads json_response[] with a response.
      sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
    }
    if (usart2_rx_flag)
    {
      //-----
        //phase_corrections[0] = 13; // slap a value in there to test with.
        //hunt_PF[0] = true; // test powerfactor hunting on CT1.
      //-----
      usart2_rx_flag = 0;
      memcpy(rx_string, rx_buff, sizeof(rx_buff));
      memset(rx_buff, 0, sizeof(rx_buff));
      huart2.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
      huart2.hdmarx->Instance->CNDTR = sizeof(rx_buff);
      huart2.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
      json_parser(rx_string); // calling this loads json_response[] with a response.
      sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
    }


    //-------------------------------
    // Print char buffers to serial.
    //-------------------------------
    if (log_buffer[0] != '\0') { // null terminated strings!
      rPi_printf(log_buffer);
      log_buffer[0] = '\0'; // set index of string to null to effectively delete the string.
      // https://stackoverflow.com/questions/632846/clearing-a-char-array-c
    }
    if (readings_rdy_buffer[0] != '\0') {
      rPi_printf(readings_rdy_buffer);
      readings_rdy_buffer[0] = '\0';
    }
    

  /* USER CODE END WHILE */

